update propuesta
